Cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("created_at", "updated_at", "birth_date", "color", "name", "sex", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "name" = $2, "color" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["birth_date", "2018-06-06"], ["name", "Fuzzy"], ["color", "white"], ["sex", "F"], ["description", "Frrr"], ["updated_at", "2019-01-30 00:43:18.334519"], ["id", 4]]